const String privacyText = '''سیاست نامه حریم خصوصی

«نان و شیرینی بلوط» به حریم خصوصی کاربران خود احترام می‌گذارد و متعهد به حفاظت از اطلاعات شخصی است که شما در اختیار آن می‌گذارید. از آنجا که جمع‌آوری و پردازش اطلاعات شخصی بخش غیرقابل اجتنابی در فرایندهای مبتنی بر گوشی همراه و اینترنت است لذا به منظور آگاهی کامل از سیاست و عملکرد شیرینی بلوط در این زمینه، مطالعه این سند تحت عنوان «سیاست نامه حریم خصوصی» و هر گونه پیام دیگری که در خصوص جمع‌آوری و پردازش اطلاعات توسط شیرینی بلوط به حساب کاربری شما ارسال می‌شود، ضروری است.
این سند مشتمل بر موارد ذیل در خصوص اطلاعات شخصی و یک واژه‌نامه است که مطالعه آن را برای درک بهتر اصطلاحات تخصصی پیشنهاد می‌کنیم.

۱- درباره شیرینی بلوط
2- کدام اطلاعات توسط نان و شیرینی بلوط جمع‌آوری می‌شوند
3- از اطلاعات چه استفاده‌ای می‌کنیم
4- اطلاعات در اختیار چه اشخاصی قرار می‌گیرند
5- امنیت اطلاعات شخصی
6- درخواست‌های شما
7- شرایط درخواست

۱- درباره نان و شیرینی بلوط
نرم‌افزار نان و شیرینی بلوط یک فروشگاه اینترنتی در حوزه فروش نان و شیرینی و وسایل تولد است که در شهر قم فعالیت می کند.

2- کدام اطلاعات توسط نان و شیرینی بلوط جمع آوری می شوند
اطلاعات ممکن است توام با نصب و/یا استفاده شما از خدمات نان و شیرینی بلوط (اطلاعات فنی و گزارش‌های سرور عمدتاً به این شیوه جمع‌آوری می‌شوند و در سرورهای ما نگهداری می‌شوند) در دسترس و اختیار نان و شیرینی بلوط قرار گیرد، همچنین نان و شیرینی بلوط ممکن است اطلاعات را مستقیماً از شما دریافت کند (هنگام ایجاد حساب کاربری، ثبت نظر، تماس و مکاتبه با پشتیبانی و یا تکمیل هر فرم یا ورود اختیاری اطلاعات).
۱-2- اطلاعاتی که با نصب و/یا استفاده از نرم‌افزار نان و شیرینی بلوط جمع‌آوری می‌شوند
اطلاعات مربوط به استفاده از خدمات نان و شیرینی بلوط و اطلاعات دستگاهی که نرم‌افزار نان و شیرینی بلوط بر روی آن نصب شده‌است همزمان با نصب نرم‌افزار بر روی دستگاه شما (بدون ایجاد حساب کاربری) جمع‌آوری می‌شوند. برخی از  این اطلاعات عبارتند از: 
۱-۱-2- نوع دستگاه، زبان و نوع سیستم عامل دستگاه شما، 
۲-۱-2- شناسه اندروید و شناسه تبلیغاتی اندروید ویژه دستگاه شما،
شناسه تبلیغاتی اندروید صرفاً به منظور تحلیل رفتار کاربر و نمایش تبلیغات یا پیشنهادات به صورت شخصی‌سازی‌شده، بدون اینکه به‌طور مستقیم به شخص حقیقی معین و مشخص مرتبط باشد، مورد استفاده قرار می‌گیرد. در صورت تغییر شناسه تبلیغاتی توسط کاربر، شناسه تبلیغاتی جدید به شناسه تبلیغاتی قبلی و اطلاعات مرتبط به آن، متصل نخواهد شد.
۳-۱-2- جست‌وجوهای انجام شده و نتایج انتخاب‌شده، 
۴-۱-2- مدت و باز‌ه‌های استفاده شما از خدمات نان و شیرینی بلوط، 
۵-۱-2- برنامه‌های نصب شده،
۶-۱-2- اطلاعات فنی و گزارش‌های سرور شامل آدرس پروتکل اینترنت (IP)، نوع شبکه و نوع و نسخه مرورگر، اطلاعات مهم دستگاه هنگام وقفه‌ها (Crashes) شامل وضعیت روت بودن یا نبودن دستگاه، میزان کل رم و میزان فضای پر آن هنگام وقفه، روز و ساعت  رخدادها، خاموش یا روشن بودن شبکه بی‌سیم، خاموش یا روشن بودن شبکه دیتا، خاموش یا روشن بودن وضعیت رومینگ، 
۷-۱-2- ما ممکن است از کوکی‌ها (cookies) در جمع‌آوری اطلاعات استفاده کنیم. کوکی فایلی است که به درخواست یک سایت، توسط مرورگر ایجاد می‌شود و به سایت امکان ذخیره بازدید‌های شما و مناسب‌سازی آنها را فراهم می‌نماید. به عنوان مثال ما با استفاده از کوکی می‌توانیم محتوایی را به شما پیشنهاد بدهیم که متناسب با علاقه‌ها و ترجیحات شما باشد. بسیاری از مرورگرها امکان غیرفعال کردن کوکی را فراهم کرده‌اند، به این منظور می‌توانید راهنمای مرورگرها را مطالعه کنید. (برای مثال، Internet Explorer، Google Chrome، Mozilla Firefox و Apple Safari)
 
۲-2- اطلاعاتی که بعد از ایجاد حساب کاربری در اختیار نان و شیرینی بلوط قرار می‌گیرد
اطلاعاتی که توسط نان و شیرینی بلوط (بعد از ایجاد حساب کاربری) جمع‌آوری می‌شوند شامل موارد ذیل است:
۱-۲-2- اطلاعاتی که برای ایجاد حساب کاربری در نرم‌افزار نان و شیرینی بلوط ضروری است شامل شماره تلفن همراه یا سایر اطلاعاتی که شما در اختیار نان و شیرینی بلوط قرار می‌دهید،
۲-۲-2- نظراتی که در نرم‌افزار نان و شیرینی بلوط ثبت می‌نمایید و فهرستی از محصولات خریداری شده 
۳-۲-2- سوابق کلیه خریدها در بستر نان و شیرینی بلوط.
در صورتی که شما مایل نیستید اطلاعات شما در اختیار نان و شیرینی بلوط قرار گیرد، لطفا از نصب نرم‌افزار نان و شیرینی بلوط و/یا ایجاد حساب کاربری و ثبت اطلاعات شخصی در سایت و نرم‌افزار نان و شیرینی بلوط خودداری نمایید.

3- نان و شیرینی بلوط از اطلاعات چه استفاده‌ای می کند
موارد عمده استفاده از اطلاعات عبارتند از:
۱-3- استفاده از اطلاعات به منظور اجرای قرارداد فعلی یا آتی بین نان و شیرینی بلوط و کاربر یا در مواردی که برای استیفای حقوق قانونی نان و شیرینی بلوط ضروری باشد. به عبارت دیگر، از آنجا که نان و شیرینی بلوط برای ارائه بهترین محصولات و خدمات، با بیشترین امنیت برای کاربر و همچنین بهبود خدمات نیاز به استفاده از برخی اطلاعات دارد، بنابراین نان و شیرینی بلوط با استفاده از اطلاعات کاربران ممکن است اقدامات ذیل را انجام دهد:
۱-۱-3- ارزیابی عملکرد سایت و نرم‌افزار نان و شیرینی بلوط و رفع اشکالات آن‌ها در نسخه‌های آتی،
۲-۱-3- افزایش امنیت و صحت عملکرد سایت و نرم‌افزار،
۳-۱-3- بهبود تجربۀ کاربری از طریق انطباق نرم‌افزار نان و شیرینی بلوط با نیازها و شرایط کاربر و سیستم‌عامل‌های مورد استفاده در دستگاه‌های متنوع کاربران،
۴-۱-3- تحلیل رفتار کاربران در استفاده از سایت و نرم‌افزار از جمله در مواجهه با نتایج جستجو و در نتیجه بهبود نتایج جست‌وجو با توجه به کلیدواژه‌های جستجو شده در میان کاربران،  
۵-۱-3- ارائه خدمات به نحوی که کاربر بتواند به نحوی کارآمد و منحصر به فرد، از کلیه امکانات موجود در سایت و برنامه استفاده کند به عنوان مثال بهبود نتایج جستجو و ارائه پیشنهاد‌های اختصاصی به کاربر،
۶-۱-3- نمایش تاریخچه جستجوهای مشابه به کاربر در هنگام جستجو،
۷-۱-3- انجام و تکمیل تراکنش و خرید درون‌برنامه‌ای،
۸-۱-3- اطلاع‌رسانی رخدادهای مهم مانند به‌روزرسانی‌های خدمات و محصولات (برنامه‌های نصب شده)، تغییرات مهم در شرایط استفاده از نان و شیرینی بلوط یا سیاست‌نامه حریم خصوصی،
۹-۱-3- پیشنهاد خدمات و برنامه‌ها بر اساس موقعیت مکانی تقریبی کاربر، جست‌وجوهای کاربر و اولویت‌هایی که به نان و شیرینی بلوط اعلام کرده است،
۱۰-۱-3- آموزش تیم پشتیبانی برای پاسخگویی به کاربران و نظارت بر عملکرد آن‌ها،
۱۱-۱-3- استفاده از اطلاعات برای طرح دعوا توسط نان و شیرینی بلوط، دفاع و پاسخگویی در برابر دعاوی مطروحه علیه نان و شیرینی بلوط و هرگونه اقدام قضایی یا اداری مرتبط به منظور دفاع از حقوق و اموال نان و شیرینی بلوط یا کاربران،
۱۲-۱-3-  حسب مورد استفاده از اطلاعات برای بازپرداخت وجوه به کاربران،
۱۳-۱-3- انجام مکاتبات و تماس با کاربران توسط تیم پشتیبانی،
۱۴-۱-3- توسعه و ارائه خدمات بهتر و بیشتر توسط نان و شیرینی بلوط یا مجموعه شرکت‌های همکار و وابسته به نان و شیرینی بلوط،

4- اطلاعات در اختیار چه اشخاصی قرار می گیرند
۱-4- نان و شیرینی بلوط ممکن است در راستای مطابقت عملکردش با قوانین و مقررات کشور اطلاعات موضوع این سند را در جریان رسیدگی قضایی و/یا در پاسخ به دستور مراجع قضایی ذی‌صلاح در اختیار نهادهای ذی‌ربط قرار دهد.
۲-4- نان و شیرینی بلوط به اشخاص ثالثی که به نحوی در ارائه خدمات با ما همکاری می‌کنند و یا وابسته به نان و شیرینی بلوط هستند، تنها در چارچوب این سند اجازه استفاده و پردازش اطلاعات شخصی شما را می‌دهد.

5-  امنیت اطلاعات شخصی
۱-5- یکی از اولویت‌های اصلی نان و شیرینی بلوط محافظت از اطلاعات حساب کاربران و جلوگیری از دسترسی‌های غیرمجاز به این اطلاعات است. بر همین اساس:
۱-۱-5- بسیاری از خدمات نان و شیرینی بلوط با SSL‌ رمزگذاری شده‌اند،
۲-۱-5- برای هر بار ورود به حساب کاربری در نان و شیرینی بلوط از رمز عبور یک‌بار مصرف (OTP) استفاده می‌شود که تنها با دسترسی به شماره تلفن همراهی که از طریق آن در نان و شیرینی بلوط، حساب کاربری خود را ایجاد کرده‌اید امکان‌پذیر است،
۳-۱-5- اطلاعات حساب یا کارت بانکی که در زمان پرداخت وارد می‌کنید، در درگاه بانکی وارد می‌شوند و به هیچ‌عنوان در نان و شیرینی بلوط دریافت و ذخیره نخواهند شد و از طریق درگاه بانکی مورد استفاده خواهند بود.
۲-5- علی‌رغم تمام رویه‌های ایمنی که نان و شیرینی بلوط مطابق با قانون به هنگام ارائه خدمات اتخاذ کرده است، متاسفانه تدابیر امنیتی را نمی‌توان به صورت صد در صدی تضمین نمود، بنابراین مقتضی است:
۱-۲-5- از اطلاعات حساب کاربری خود محافظت کرده و آن‌ها را در اختیار اشخاص ثالث قرار ندهید،
2-۲-5- در صورت وقوع سرقت گوشی همراه و همچنین پیش از واگذاری شماره تلفنی که با آن حساب کاربری ایجاد کرده‌اید، موضوع را به نان و شیرینی بلوط اطلاع دهید تا حساب کاربری شما تعلیق شده یا اطلاعات موجود در آن تغییر کند. در غیر این صورت و در موارد دسترسی اشخاص ثالث، تمامی مسئولیت هرگونه استفاده یا سوءاستفاده از حساب کاربری شما به عهدۀ شخص شماست و نان و شیرینی بلوط هیچ‌گونه مسئولیتی در این مورد ندارد.

6- درخواست های شما
تحت شرایطی، شما می توانید متقاضی هر یک از موارد ذیل در رابطه با اطلاعات شخصی خود باشید:
۱-6- درخواست دسترسی به اطلاعات شخصی خود که در اختیار نان و شیرینی بلوط قرار دارد،
۲-6- درخواست تکمیل اطلاعات ناقص یا اصلاح اطلاعات نادرستی که در اختیار نان و شیرینی بلوط قرار دارد،
۳-6- درخواست حذف یا محو کردن اطلاعات شخصی؛ در این خصوص نان و شیرینی بلوط درخواست شما را بررسی و تنها در چارچوبی که قانون اجازه می‌دهد اطلاعات را حذف یا محو می‌نماید و به نحو مقتضی به شما اطلاع‌رسانی خواهد کرد،
۴-6- اعلام عدم رضایت نسبت به جمع‌آوری، ذخیره، پردازش و توزیع اطلاعات شخصی در مواردی که به موجب قانون این اقدامات مستلزم رضایت شماست؛ در این خصوص نان و شیرینی بلوط درخواست شما را بررسی و تنها در چارچوبی که قانون اجازه می‌دهد اقدام و به نحو مقتضی به شما اطلاع‌رسانی خواهد کرد. همانطور که قبلا ذکر شد، عدم دسترسی نان و شیرینی بلوط به برخی اطلاعات، ممکن است مانع ارائه تمام یا برخی از خدمات یا عملکرد مناسب برنامه گردد.

7- شرایط درخواست:
۱-7- شما می توانید درخواست های خود را به نشانی الکترونیکی info@shirinibalout.com ارسال نمایید.
۲-7- درخواست شما در هیچ یک از موارد فوق متضمن پرداخت هزینه نمی‌باشد.
۳-7- در هر یک از موارد فوق، نان و شیرینی بلوط ممکن است اطلاعاتی را به منظور تأیید هویت و حصول اطمینان از حق دسترسی شما به اطلاعات شخصی، درخواست کند. این اقدامات و تدابیر با هدف محافظت از اطلاعات و جلوگیری از دسترسی‌های غیرمجاز به اطلاعات شخصی شما انجام می‌شوند.
۴-7- نان و شیرینی بلوط هر درخواست را ظرف حداکثر یک ماه پاسخ خواهد داد مگر آنکه پیچیدگی یا تعدد موضوعات بررسی طولانی‌تری را اقتضا کند؛ در این صورت نان و شیرینی بلوط، اطلاع‌رسانی های لازم را انجام خواهد داد.
''';
